[
  {
    "id": "ai-client-reports",
    "title": "AI Client Reports",
    "description": "A WhatsApp bot that generates business reports using AI, with a web interface to visualize and manage reports. Enhanced with RAG (Retrieval-Augmented Generation) for knowledge-based responses using uploaded documents. Features both WhatsApp integration and a complete web dashboard.",
    "overview": "Ask for company analysis via WhatsApp or web interface. The bot uses AI (Groq/LLaMA) enhanced with a RAG system to generate business reports and insights based on your uploaded documents. Everything can be downloaded as PDF.",
    "howItWorks": [
      "WhatsApp Bot: Send 'analyze Tesla' and get a complete report enhanced with your knowledge base.",
      "Web Interface: More complete version with history, templates, and RAG document management.",
      "RAG System: Upload documents (PDF, DOCX, TXT, MD, HTML, JSON) to build your own knowledge base.",
      "Vector Search: Semantic search through your documents for enhanced AI responses.",
      "PDF Export: Generate and download organized reports as PDF files."
    ],
    "tools": [
      "Node.js",
      "Express.js",
      "@whiskeysockets/baileys",
      "Groq API (LLaMA 3 70B)",
      "Next.js",
      "React 19",
      "TypeScript",
      "TailwindCSS",
      "HeroUI",
      "PDFKit",
      "jsPDF",
      "Custom RAG System"
    ],
    "limitations": [
      "Sessions are lost when server restarts (no database yet).",
      "Only works with one WhatsApp number at a time.",
      "RAG system is in-memory only (vectors lost on restart).",
      "Performance drops with many simultaneous users.",
      "Requires stable internet connection for AI and WhatsApp Web."
    ],
    "image": "/images/projects/ai-client-reports.png",
    "tags": ["AI", "WhatsApp Bot", "RAG", "Business Intelligence", "Groq", "LLaMA", "Next.js", "Express.js", "Vector Search", "Document Processing"],
    "slug": "ai-client-reports",
    "githubUrl": "https://github.com/BraianMendes/ai-client-reports"
  },
  {
    "id": "ai-medical-prescription-reader",
    "title": "Intelligent Medical Prescription Reader",
    "description": "Proof of Concept (POC) web app built with Next.js, demonstrating OCR and NLP to read, interpret, and standardize information from medical prescriptions in image format. Automates reading and understanding prescriptions using AI, making the process faster, safer, and less prone to human error. Uses Tesseract.js for OCR and compromise for NLP to extract and normalize drug names, dosages, and quantities, even with writing variations or OCR errors. Not intended for production or real medical use.",
    "overview": "Uploads a prescription image, extracts text with Tesseract.js, processes and normalizes with compromise NLP, and returns structured drug info. Uses a local, simplified database for simulation.",
    "howItWorks": [
      "User uploads a photo of a medical prescription.",
      "Tesseract.js extracts text from the image.",
      "Compromise NLP normalizes and processes the text, identifying drug name, dosage, and quantity.",
      "System standardizes drug names and returns structured data.",
      "Uses a local, limited database for demonstration only."
    ],
    "tools": [
      "Tesseract.js (OCR)",
      "Compromise (NLP)",
      "Next.js"
    ],
    "limitations": [
      "POC for technical demonstration only.",
      "Local, limited database (not comprehensive).",
      "Not for real or production use."
    ],
    "image": "/images/projects/ai-medical-prescription-reader.png",
    "tags": ["AI", "Healthcare", "OCR", "NLP", "Tesseract.js", "Compromise", "Next.js"],
    "slug": "ai-medical-prescription-reader",
    "githubUrl": "https://github.com/BraianMendes/AI_Medical_Prescription_Reader"
  },
  {
    "id": "braian-portfolio",
    "title": "Braian Mendes Portfolio",
    "description": "Personal portfolio built with Next.js, React, and Tailwind CSS. Showcases my projects, certifications, recommended books, and blog posts. Features advanced filtering, responsive and accessible UI, and a modern developer experience.",
    "overview": "A modern, performant, and accessible portfolio to present my work, learning journey, and thoughts on software engineering. Includes sections for projects, certifications, books, blog, and about.",
    "howItWorks": [
      "Visitors can browse and filter projects, certifications, and books.",
      "Each section provides detailed information and links.",
      "Blog and documentation sections for sharing knowledge and guides.",
      "Responsive and theme-aware UI for all devices."
    ],
    "tools": [
      "Next.js",
      "React",
      "TypeScript",
      "Tailwind CSS",
      "HeroUI",
      "next-themes",
      "Framer Motion"
    ],
    "limitations": [
      "Blog and documentation sections are under construction.",
      "Continuously evolving with new features and content."
    ],
    "image": "/images/projects/portfolio-cover.png",
    "tags": ["Portfolio", "Next.js", "React", "Tailwind CSS", "TypeScript", "HeroUI"],
    "slug": "braian-portfolio",
    "githubUrl": "https://github.com/BraianMendes/braian-portfolio"
  }
]
